# Proyecto 2 - Analytics
## Ciencias de Datos en Python

- Diego Morales - 13001893
- Jerry Rivera - 24005123

In [1]:
import boto3
import pandas as pd
import numpy as np
import configparser
import psycopg2

## Inicialización

In [2]:
config = configparser.ConfigParser()
config.read('config.cfg')

aws_rds_conn = boto3.client('rds', aws_access_key_id=config.get('IAM', 'ACCESS_KEY'),
                           aws_secret_access_key=config.get('IAM', 'SECRET_KEY'),
                           region_name='us-east-1')

## Obtención de instancia

In [3]:
try:
    instance2 = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('SAKILA2', 'DB_INSTANCE_ID'))
    RDS_HOSTNAME2 = instance2.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME2)
except Exception as ex:
    print('Error', ex)

sakila2-db-pg.clcwc6cec8sd.us-east-1.rds.amazonaws.com

In [5]:
mysql_driver = f"""mysql+pymysql://{config.get('SAKILA2', 'DB_USERNAME')}:{config.get('SAKILA2', 'DB_PASSWORD')}@{RDS_HOSTNAME2}:{config.get('SAKILA2', 'DB_PORT')}/{config.get('SAKILA2', 'DB_NAME')}"""  
mysql_driver

'mysql+pymysql://admin_mysql:jublnuh1Kor3KEPO1rADldLmi@sakila2-db-pg.clcwc6cec8sd.us-east-1.rds.amazonaws.com:3306/sakila2'

In [7]:
sql_query = 'SELECT * FROM dim_colaborador;'
dim_colaborador = pd.read_sql(sql_query, mysql_driver)
dim_colaborador.head()

,idusuario,idrol,nombre_colaborador,tipo_documento,num_documento,direccion,telefono,email,clave,estado_colaborador,nombre_rol,descripcion,estado_rol
0,0,5,Ashlee Burke,DPI,26869345083476836496,Unit 4864 Box 2543\nDPO AE 59738,+1-529-460-5962x3160,grace58@gmail.com,b'1010101',b'\x01',Contador,Finanzas de la tienda,b'\x01'
1,1,3,Stacey Nelson,DPI,23610195656716752703,"692 Mary Village Suite 679\nFreemanchester, NM...",745-652-2045x7439,nathaniel90@gmail.com,b'1010101',b'\x01',Asistente,Apoyo para ventas,b'\x01'
2,2,2,Angela Mason,DPI,21429777191932313135,"8162 Monica Heights\nEast Kevinstad, NH 32955",381-624-7706,sbrown@gmail.com,b'1010101',b'\x01',Vendedor,Encargado de las ventas,b'\x01'
3,3,1,Daniel Reed,DPI,22128757048421280494,"20762 David Ford Apt. 060\nSouth Charles, MA 7...",001-275-354-0448x474,jacksonjack@gmail.com,b'1010101',b'\x01',Dueño,Propietario de la tienda,b'\x01'
4,4,4,Nicholas Potter,DPI,23421141874913153979,"9260 Carroll Islands Apt. 961\nEast Tammytown,...",+1-377-242-7951x4928,michelle70@gmail.com,b'1010101',b'\x01',Mensajero,Entrega de pedidos a domicilio,b'\x01'

In [8]:
sql_query = 'SELECT * FROM dim_producto;'
dim_producto = pd.read_sql(sql_query, mysql_driver)
dim_producto.head()

,idarticulo,idcategoria,codigo,nombre_producto,precio_venta,stock,descripcion_producto,imagen,estado_producto,nombre_categoria,descripcion_categoria,estado_categoria
0,1,1,torlim,Totrix limón,2.00,14,unidad de 38 gramos,torlim.png.,b'\x01',Alimentos,"Pan, galletas, snacks y helados",b'\x01'
1,2,1,sandbutt,Pan Sándwich Butter,22.95,13,bolsa de 690 gramos,sandbutt.png.,b'\x01',Alimentos,"Pan, galletas, snacks y helados",b'\x01'
2,3,1,gallchk,Galleta Chocolate Chiky Pack,19.30,10,"pack de 10 unidades, 40 gramos/unidad",gallchik.png.,b'\x01',Alimentos,"Pan, galletas, snacks y helados",b'\x01'
3,4,1,gallwaff,Galleta Waffle 12 pack,12.70,19,pack de 256.5 gramos,gallwaff.png.,b'\x01',Alimentos,"Pan, galletas, snacks y helados",b'\x01'
4,5,2,cczero,Coca Cola sin azúcar,16.00,10,envase de 2.5 litros’,cczero.png.,b'\x01',Bebidas,"Agua, gaseosas, jugos y leche",b'\x01'

In [9]:
sql_query = 'SELECT * FROM dim_persona;'
dim_persona = pd.read_sql(sql_query, mysql_driver)
dim_persona.head()

,idpersona,tipo_persona,nombre,tipo_documento,num_documento,direccion,telefono,email
0,0,Proveedor,Timothy Hodge,DPI,28225718819942142367,"05486 Reeves Crest\nWest Phillipstad, VA 15380",+1-516-246-9239x841,sarahponce@gmail.com
1,1,Cliente,Ashley Castillo,DPI,21148297307142326897,"0510 Brian Lake\nAllisonland, TN 50635",704-480-8114x31359,woodrebecca@gmail.com
2,2,Proveedor,Joanne Day,DPI,24277444232848164940,"508 Garcia Villages Apt. 078\nBrownton, GA 96045",(574)327-0117x90900,scastillo@gmail.com
3,3,Proveedor,Michael Howell,DPI,23551321417884376403,"6367 Brandon Station\nNorth Scottfurt, AK 04031",(408)406-9927,stanley34@gmail.com
4,4,Proveedor,Connie Gray,DPI,24853225327540908301,"PSC 2482, Box 8602\nAPO AE 12771",442.505.1970,vray@gmail.com

In [10]:
sql_query = 'SELECT * FROM fact_venta;'
fact_venta = pd.read_sql(sql_query, mysql_driver)
fact_venta.head()

,idventa,idcliente,idusuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,0,11,4,Factura,3003665,3472946217,2024-01-29,9.67,80.60,1
1,1,16,3,Factura,1637960,7254456563,2024-01-23,3.05,25.40,1
2,2,12,4,Factura,7362158,1817013100,2024-02-17,0.48,4.00,1
3,3,17,1,Factura,8768881,4333202809,2024-01-02,3.71,30.90,1
4,4,12,1,Factura,2779690,7873066678,2024-01-09,10.17,84.75,1

In [11]:
sql_query = 'SELECT * FROM dim_venta;'
dim_venta = pd.read_sql(sql_query, mysql_driver)
dim_venta.head()

   iddetalle_venta  idventa  idarticulo  cantidad  precio  descuento
0                0        0           9         3   16.15        0.0
1                1        0           5         1   16.00        0.0
2                2        0           9         1   16.15        0.0
3               10        1           4         1   12.70        0.0
4               11        1           4         1   12.70        0.0

In [12]:
sql_query = 'SELECT * FROM fact_ingreso;'
fact_ingreso = pd.read_sql(sql_query, mysql_driver)
fact_ingreso.head()

,idingreso,idproveedor,idusuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,0,0,2,Factura,3437357,5240659148,2024-03-17,19.19,159.9,1
1,1,2,0,Factura,7693968,6944291162,2024-03-14,20.92,174.3,1
2,2,14,4,Factura,6953654,4583417347,2024-01-29,5.83,48.6,1

In [13]:
sql_query = 'SELECT * FROM dim_ingreso;'
dim_ingreso = pd.read_sql(sql_query, mysql_driver)
dim_ingreso.head()

   iddetalle_ingreso  idingreso  idarticulo  cantidad  precio
0                  0          0           2         2   22.95
1                  1          0           5         1   16.00
2                  2          0           7         2    9.90
3                  3          0           2         2   22.95
4                  4          0           9         2   16.15

# Analytics

1. ¿Cuáles son los productos que más dinero generan?

2. ¿Cuáles son los 5 mayores clientes?

3. ¿Cuál es la categoría con más artículos?

4. ¿Cuál es el usuario que más ventas realiza?

5. ¿Qué día de la semana genera más ventas?